# while condition:
#     ...

# word = input()
# while word != 'END':
#     print(word)
#     word = input()

# Якщо ви вводите довільну кількість елементів з клавіатури, але в вас нічого не йде на вхід на початку,
# (а в пайтоні немає циклу do while), то перший елемент - точку відштовхування (тобто перше значення змінної)
# вартує вводити перед циклом

# Оскільки цикл while працює на одній єдиній умові, якщо ви хочете, щоб він не був нескніченим, треба, щоб
# якась з частин, що є в умові, мінялась

# обчислення суми факторіалів
def sum_of_factorials(upper_limit: int) -> int:
    sum_value = 0
    for i in range(2, upper_limit + 1):
        factorial = 1
        for j in range(1, i + 1):
            factorial *= j
        sum_value += factorial
    return sum_value + 2


# Обчислення цифр числа за допомогою циклу while
def get_first_digit(number: int):
    while number > 9:
        number //= 10
    return number


def get_last_digit(number: int):
    return number % 10

# Фактичні помилки:
# - відсутність початкової ініціалізації змінної
# - неправильна ініціалізація змінної
# - неравильні відступи
# - неправильні межові числові значення (наприклад, в функції range())
# - неправильні межові порівняння (наприклад, сплутування > та >=)
# - сплутування логічних операцій and, or

# Читабельність коду:
# - відступи та пробіли
# - назви змінних
# - пусті стрічки
# - коментарі
