def multitask(initial_list: list[int]):
    """На вхід програмі подається список.
    :return список, в якому
    - Замінений другий елемент на 17
    - додано 4, 5, 6 в кінець списку
    - видалений перший елемент списку
    - подвоєні елементи (типу два рази такий самий список, але в одному)
    - вставлене число 25 за індексом 3
    всі дії треба виконувати в такому порядку"""
    initial_list[1] = 17
    initial_list.extend([4, 5, 6])
    initial_list.pop(0)
    initial_list.extend(initial_list)
    initial_list.insert(3, 25)
    return initial_list


def rearrange_min_and_max(initial_list: list[int]):
    """На вхід програмі подається список чисел.
    :return список, в якому переставлені максимальне і мінімальне число
    * згадайте (а, б = б, а)"""
    # list[index1], list[index2] = list[index2], list[index1]
    # 1) знайти індекси мінімального та максимального
    # 2) переставити їх за індексами
    # 3) повернути список
    # list[1], list[3] = list[3], list[1]
    # [1, 7, 0, -5, 2]
    # return [1, -5, 0, 7, 2]


def amount_of_articles(text: str):
    """На вхід програмі подається текст.
    :return кількість артиклів a, an, the в тексті. Артиклі можуть бути довільного регістру"""
    """comprehension_2 = [element ** 2 for element in range(10) if element % 3 == 0]
print(comprehension_2)  # [0, 9, 36, 81]"""
    comprehension = []
    # звести текст до одного регістру
    # утворити список слів
    # порахувати, скільки слів a, an, the в списку
    # повернути це число


def clear_comments(text: str):
    """На вхід програмі подається текст. Рядки розділені символом нового рядка.
    В тексті в кінці деяких рядків залишені коментарі (коментарі починаються з символу #)
    :return текст з очищеними коментарями"""


def sort_all_digits(text: str):
    """На вхід програмі подається текст, в якому є цифри.
    :return стрічку з посортованих цифр, зʼєднаних за комою з пробілом"""


def length_of_words(text: str):
    """На вхід програмі подається текст.
    :return список, в якому один елемент - довжина одного слова"""


def filter_words(text: str):
    """На вхід програмі подається текст.
    :return список, в якому тільки слова довжиною понад 5 символів"""


def palindomes_in_range(lower_limit: int, upper_limit: int):
    """На вхід програмі подаються межі.
    :return список всіх числових паліндромів в цих межах"""


def get_all_digits(text: str):
    """На вхід програмі подається текст.
    :return список цифр з тексту"""
