# Ітератор - це певна колекція, яка містить в собі передбачену логіку почергового проходження (перебирання) - ітерації
#
# - помідори
# - масло
# - сметана
# - олія
# - банка малинового варення
# [1, 2, 3, 4, 5, 6]
import time

ten_range = range(10)  # 0, 1, 2, 3, 4, 5, 6, 7, 8, 9

for i in ten_range:
    print(i, end=' ')
    time.sleep(1)

# range(початок, кінець, крок)
range(3, 21)  # 3, 4, 5, 6, 7, 8, ..., 20
range(2, 14, 2)  # 2, 4, 6, 8, 10, 12
range(10, 3, -1)  # 10, 9, 8, 7, 6, 5, 4

# Часті задачі на цикли
# 1. Підрахунок
# Підрахувати кількість чисел на проміжку від 0 до 100 включно, які діляться на 7 націло
counter = 0
for i in range(101):
    if i % 7 == 0:
        counter += 1

# 2. Сумування / добуток
# Знайти добуток чисел від 1 до 10, які не є кратними 3
multiplication = 1
for i in range(1, 11):
    if i % 3 != 0:
        multiplication *= i

# 3. Прапорець (булеві значення)
# Дослідити число на те, чи воно є простим
number = int(input())
is_prime = True
for i in range(2, number // 2 + 1):
    if number % i == 0:
        is_prime = False

# Якщо вам потрібно динамічно вводити в цикл якісь значення, ви можете використовувати input() прямо в циклі
for _ in range(10):
    value = input()
    print(value)
